## Estadistica Aplicada
Sesion 4, 14 de agosto
Susana Yareli Lino Resendiz - 1986245

In [6]:
#Crear una lista
lista1 = ['Jaime','Pedro','Maria']

In [7]:
#Añadir un elemento mas a la lista
lista1.append('Jimena')

In [8]:
lista1

['Jaime', 'Pedro', 'Maria', 'Jimena']

In [9]:
#Tuplas (son con parentesis en ves de corchete)
tupla1 = (23, 45, 'libro')

In [10]:
type(tupla1)

tuple

In [11]:
#Da error porque las tuplas no se pueden modificar ya que es su principal caracteristica una vez creada la tupla no se puede modificar
tupla1.append('pluma')
tupla1

AttributeError: 'tuple' object has no attribute 'append'

In [12]:
#Diccionarios o mapeo de valores
#Un diccionario es un par de clave-valor y se abre con llave
#Primero nombre de variable y despues su valor
alumno_dic = {'Nombre':'Juan', 'Apellido':'Perez', 'Edad': 21}
alumno_dic['Nombre']

'Juan'

In [13]:
#Accedemos a las variables
alumno_dic.keys()

dict_keys(['Nombre', 'Apellido', 'Edad'])

In [14]:
#Accedemos a el contenido de las variables
alumno_dic.values()

dict_values(['Juan', 'Perez', 21])

In [15]:
#Crear un diccionario de los alumnos del grupo
estadistica_g41 = {'Nombre':['Juan','Sebastian','Sorely'],'Edad':[19,19,18.5],}

In [16]:
estadistica_g41.keys()

dict_keys(['Nombre', 'Edad'])

In [17]:
estadistica_g41.values()

dict_values([['Juan', 'Sebastian', 'Sorely'], [19, 19, 18.5]])

## Pandas
Se utiliza para manipular datos estructurados. Esta construida sobre numpy eso significa que cualquier funcion de numpy funciona en pandas. En pandas hay 3 estructuras de datos:
1. Series (unidimensionales)
2. Dataframes (datos en filas y columnas)
3. Panel (filas y columnas organizadas a traves de tiempo)

In [18]:
#Series
#Supongamos que conocemos las edades de las siguientes personas: Juan 10, Pedro 20, Jorge 30, Ale 40 y Alba 50
edades = [10, 20, 30, 40, 50]
edades

[10, 20, 30, 40, 50]

In [19]:
#Vamos a utilizar serie por lo que vamos a importar la libreria de pandas
import pandas as pd

In [20]:
serie1 = pd.Series(edades, index=['Juan', 'Pedro', 'Jorge', 'Ale', 'Alba'])
serie1

Juan     10
Pedro    20
Jorge    30
Ale      40
Alba     50
dtype: int64

In [21]:
#Promedio de las edades
serie1.mean()

30.0

In [22]:
#Varianza de las edades
serie1.var()

250.0

In [23]:
#Desviacion estandar de las edades
serie1.std()

15.811388300841896

In [24]:
#Dataframes
#Son datos en filas y columnas
alumno1 = ['Juan','Perez', 23]
alumno2 = ['Raul', 'Gonzalez', 17]
alumno3 = ['Jimena','Rosas', 20]
alumno4 = ['Alejandra', 'Saldaña', 21]

In [25]:
clase_estadistica = [alumno1, alumno2, alumno3, alumno4]
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [26]:
df_clase = pd.DataFrame(clase_estadistica, columns=['Nombre', 'Apellido', 'Edad'])
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

In [27]:
type(df_clase)

pandas.core.frame.DataFrame

In [28]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [30]:
#Agregar una nueva columna 
df_clase['Estado'] = ['Nuevo León', 'Coahuila', 'Nuevo León', 'Veracruz']

In [31]:
df_clase

      Nombre  Apellido  Edad      Estado
0       Juan     Perez    23  Nuevo León
1       Raul  Gonzalez    17    Coahuila
2     Jimena     Rosas    20  Nuevo León
3  Alejandra   Saldaña    21    Veracruz

In [32]:
df_clase = df_clase.set_index('Nombre')
df_clase

           Apellido  Edad      Estado
Nombre
Juan          Perez    23  Nuevo León
Raul       Gonzalez    17    Coahuila
Jimena        Rosas    20  Nuevo León
Alejandra   Saldaña    21    Veracruz

In [33]:
df_clase['Edad_en_dias'] =df_clase['Edad']*365
df_clase

           Apellido  Edad      Estado  Edad_en_dias
Nombre
Juan          Perez    23  Nuevo León          8395
Raul       Gonzalez    17    Coahuila          6205
Jimena        Rosas    20  Nuevo León          7300
Alejandra   Saldaña    21    Veracruz          7665

In [34]:
df_clase['Edad_en_meses'] =df_clase['Edad']*12
df_clase

           Apellido  Edad      Estado  Edad_en_dias  Edad_en_meses
Nombre
Juan          Perez    23  Nuevo León          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo León          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

## Tipos de seleccion en DataFrames
1. Selección estandar
2. iloc
3. loc
4. Boleanos (filtros)

In [35]:
#Seleccion estandar
df_clase['Apellido']

Nombre
Juan            Perez
Raul         Gonzalez
Jimena          Rosas
Alejandra     Saldaña
Name: Apellido, dtype: object

In [36]:
#Seleccionar columnas
#Siempre que tengo 2 objetos se pone doble corchete
df_clase[['Edad', 'Apellido']]

           Edad  Apellido
Nombre
Juan         23     Perez
Raul         17  Gonzalez
Jimena       20     Rosas
Alejandra    21   Saldaña

In [37]:
#Seleccionar filas se necesita dar un rango
df_clase[0:2]

        Apellido  Edad      Estado  Edad_en_dias  Edad_en_meses
Nombre
Juan       Perez    23  Nuevo León          8395            276
Raul    Gonzalez    17    Coahuila          6205            204

In [38]:
#Elegir columna edad y las filas 0 y 1
#Primero se selecciona las filas y despues columnas
df_clase[0:2]['Edad']

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

In [39]:
#Seleccion por posicion iloc dataframe.iloc[Filas, columnas]
df_clase.iloc[0:2,1]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

In [40]:
df_clase.iloc[:, 1]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [41]:
#Seleccion por etiquetas loc dataframe.loc[Filas, columnas]
df_clase.loc[:, 'Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [42]:
df_clase.loc['Juan', 'Edad']

23

In [89]:
edad_juan = df_clase.loc['Juan', 'Edad']

In [43]:
#Seleccion con codicionales (boleanos)
df_clase[df_clase['Edad']>20]

          Apellido  Edad      Estado  Edad_en_dias  Edad_en_meses
Nombre
Juan         Perez    23  Nuevo León          8395            276
Alejandra  Saldaña    21    Veracruz          7665            252

In [44]:
df_clase['Edad']

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [45]:
df_clase['Edad'].mean()

20.25

In [46]:
df_clase['Edad'].std()

2.5

In [47]:
df_clase['Edad'].sum()

81

In [48]:
import numpy as np

In [58]:
#np.where(codicion, valor si se cumple la condicion, si no se cumple la condicion)
df_clase['Mayor_de_edad'] = np.where(df_clase['Edad']>=18, 'Mayor de edad', 'Menor de edad')

In [59]:
df_clase

,Apellido,Edad,Estado,Edad_en_dias,Edad_en_meses,Condicion de estudio,Mayor_de_edad
Nombre,,,,,,,
Juan,Perez,23,Nuevo León,8395,276,Egresados,Mayor de edad
Raul,Gonzalez,17,Coahuila,6205,204,Prepa,Menor de edad
Jimena,Rosas,20,Nuevo León,7300,240,Licenciatura,Mayor de edad
Alejandra,Saldaña,21,Veracruz,7665,252,Licenciatura,Mayor de edad

In [60]:
#np.select np.select(condicones, valor para cada condicion, valor si no se cumple ninguna condicion)
condiciones = [df_clase['Edad']<=17,
               df_clase['Edad']<23,
               df_clase['Edad']>=23]
valor_condicion = ['Prepa', 'Licenciatura', 'Egresados']
df_clase['Condicion de estudio'] = np.select(condiciones,valor_condicion, default='Invalido')
df_clase

,Apellido,Edad,Estado,Edad_en_dias,Edad_en_meses,Condicion de estudio,Mayor_de_edad
Nombre,,,,,,,
Juan,Perez,23,Nuevo León,8395,276,Egresados,Mayor de edad
Raul,Gonzalez,17,Coahuila,6205,204,Prepa,Menor de edad
Jimena,Rosas,20,Nuevo León,7300,240,Licenciatura,Mayor de edad
Alejandra,Saldaña,21,Veracruz,7665,252,Licenciatura,Mayor de edad

In [61]:
df_clase['Edad'].count()

4

In [62]:
df_clase.value_counts('Condicion de estudio')

Condicion de estudio
Licenciatura    2
Egresados       1
Prepa           1
dtype: int64

In [63]:
df_clase['Edad'].mean()

20.25

In [64]:
df_clase.groupby('Mayor_de_edad').mean().round(1)

C:\Users\DELL\AppData\Local\Temp\ipykernel_6764\3540424358.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_clase.groupby('Mayor_de_edad').mean().round(1)

               Edad  Edad_en_dias  Edad_en_meses
Mayor_de_edad
Mayor de edad  21.3        7786.7          256.0
Menor de edad  17.0        6205.0          204.0

In [65]:
#aggregate agg sirve para resumir datos
df_clase.agg(['count','mean'])

C:\Users\DELL\AppData\Local\Temp\ipykernel_6764\3732773074.py:2: FutureWarning: ['Apellido', 'Estado', 'Condicion de estudio', 'Mayor_de_edad'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_clase.agg(['count','mean'])

,Apellido,Edad,Estado,Edad_en_dias,Edad_en_meses,Condicion de estudio,Mayor_de_edad
count,4.0,4.00,4.0,4.00,4.0,4.0,4.0
mean,NaN,20.25,NaN,7391.25,243.0,NaN,NaN

In [66]:
#query
df_clase.query('Nombre=="Alejandra"')

,Apellido,Edad,Estado,Edad_en_dias,Edad_en_meses,Condicion de estudio,Mayor_de_edad
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Licenciatura,Mayor de edad

In [67]:
df_clase.query('Nombre=="Alejandra" & Edad > 20')

,Apellido,Edad,Estado,Edad_en_dias,Edad_en_meses,Condicion de estudio,Mayor_de_edad
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Licenciatura,Mayor de edad

In [70]:
calificaciones = pd.read_csv("https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv")

In [79]:
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [80]:
calificaciones.shape

(28, 4)

In [81]:
calificaciones.head(5)

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [82]:
#Vamos a elegir todas las columnas menos id
calificaciones = calificaciones.loc[:,calificaciones.columns!='Id']

In [83]:
#Renombrar 
calificaciones = calificaciones.rename(columns={'Calficación Final':'CaliFinal'})
calificaciones.head()

    Nombre   Apellido  CaliFinal
0  ANTONIO     GARCIA         73
1   MANUEL  FERNANDEZ         19
2     JOSE   GONZALEZ         38
3    DAVID      PEREZ         14
4     JUAN      LOPEZ         99

In [84]:
calificaciones['Situacion']=np.where(calificaciones['CaliFinal'] >= 70, 'Aprobado','Reprobado')
calificaciones.value_counts('Situacion')

Situacion
Reprobado    18
Aprobado     10
dtype: int64

In [90]:
calificaciones.CaliFinal.mean()

52.0

In [94]:
promedio_a=calificaciones.query('Situacion=="Aprobado"').CaliFinal.mean()
promedio_r=calificaciones.query('Situacion=="Reprobado"').CaliFinal.mean().round(2)
print(f'El promedio de los alumnos aprobados es de:', promedio_a)
print(f'El promedio de los alumnos reprobados es de:', promedio_r)

El promedio de los alumnos aprobados es de: 90.1
El promedio de los alumnos reprobados es de: 30.83